In [4]:
import numpy as np
import pandas as pd

In [6]:
df = pd.read_csv('~/Projects/Oddcard2/education/Coursera/ML_Yandex/week1/titanic.csv', index_col='PassengerId')

In [7]:
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

1. Какое количество мужчин и женщин ехало на корабле? В качестве ответа приведите два числа через пробел.
2. Какой части пассажиров удалось выжить? Посчитайте долю выживших пассажиров. Ответ приведите в процентах (число в интервале от 0 до 100, знак процента не нужен), округлив до двух знаков.
3. Какую долю пассажиры первого класса составляли среди всех пассажиров? Ответ приведите в процентах (число в интервале от 0 до 100, знак процента не нужен), округлив до двух знаков.
4. Какого возраста были пассажиры? Посчитайте среднее и медиану возраста пассажиров. В качестве ответа приведите два числа через пробел.
5. Коррелируют ли число братьев/сестер/супругов с числом родителей/детей? Посчитайте корреляцию Пирсона между признаками SibSp и Parch.
6. Какое самое популярное женское имя на корабле? Извлеките из полного имени пассажира (колонка Name) его личное имя (First Name). Это задание — типичный пример того, с чем сталкивается специалист по анализу данных. Данные очень разнородные и шумные, но из них требуется извлечь необходимую информацию. Попробуйте вручную разобрать несколько значений столбца Name и выработать правило для извлечения имен, а также разделения их на женские и мужские.

In [13]:
def to_file(name, line):
    with open(name, 'w') as f:
        f.write(line)
        print(line)

In [94]:
# 1

sexes = df.Sex.value_counts()
to_file('1.txt', '{} {}'.format(sexes['male'], sexes['female']))

577 314

In [74]:
# 2

survived = sum(df.Survived)
survived_percents = round(survived *100 / len(df), 2)
to_file('2.txt', '{}'.format(survived_percents))

38.38

In [75]:
# 3

first_class_count = len(df[df.Pclass == 1])
first_class_percent = round(first_class_count *100 / len(df), 2)
to_file('3.txt', '{}'.format(first_class_percent))

24.24

In [76]:
# 4
mean_age = round(df.Age.mean(), 2)
median_age = round(df.Age.median())

to_file('4.txt', '{} {}'.format(mean_age, median_age))

29.7 28

In [77]:
# 5

corr = round(df.SibSp.corr(df.Parch), 2)
to_file('5.txt', '{}'.format(corr))

0.41

In [83]:
df[(df.Sex == 'female') & ~(df.Name.str.contains('\('))]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...
867,1,2,"Duran y More, Miss. Asuncion",female,27.0,1,0,SC/PARIS 2149,13.8583,NaN,C
876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [51]:
df[(df.Sex == 'female') & ~(df.Name.str.contains('Mrs.') | df.Name.str.contains('Miss.'))]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
370,1,1,"Aubart, Mme. Leontine Pauline",female,24.0,0,0,PC 17477,69.3000,B35,C
444,1,2,"Reynaldo, Ms. Encarnacion",female,28.0,0,0,230434,13.0000,NaN,S
642,1,1,"Sagesser, Mlle. Emma",female,24.0,0,0,PC 17477,69.3000,B35,C
760,1,1,"Rothes, the Countess. of (Lucy Noel Martha Dye...",female,33.0,0,0,110152,86.5000,B77,S
797,1,1,"Leader, Dr. Alice (Farnham)",female,49.0,0,0,17465,25.9292,D17,S

In [44]:
df[df.Sex == 'female'].Name

PassengerId
2      Cumings, Mrs. John Bradley (Florence Briggs Th...
3                                 Heikkinen, Miss. Laina
4           Futrelle, Mrs. Jacques Heath (Lily May Peel)
9      Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
10                   Nasser, Mrs. Nicholas (Adele Achem)
                             ...
881         Shelley, Mrs. William (Imanita Parrish Hall)
883                         Dahlberg, Miss. Gerda Ulrika
886                 Rice, Mrs. William (Margaret Norton)
888                         Graham, Miss. Margaret Edith
889             Johnston, Miss. Catherine Helen "Carrie"
Name: Name, Length: 314, dtype: object

In [85]:
def get_name(line):
    prefixes = ['Miss.', 'Mrs.', 'Dr.', 'Ms.', 'Mme.']
    parts = line.split(' ')
     
    idx = -1
    for i, p in enumerate(parts):
        if p.strip().startswith('('):
            v = p[1:]
            if v.endswith(')'):
                v = v[:-1]
            return v
        
    for i, p in enumerate(parts):
        v = p.strip()
        if v in prefixes:
            idx = i
            break
    if idx != -1 and idx+1<len(parts):
        return parts[idx+1]
    return ''

In [92]:
# 6

most_freq_name = df[df.Sex == 'female'].Name.apply(lambda x: get_name(x)).mode()[0]
to_file('6.txt', '{}'.format(most_freq_name))

Anna

## Задание по программированию: Важность признаков

1. Загрузите выборку из файла titanic.csv с помощью пакета Pandas.
2. Оставьте в выборке четыре признака: класс пассажира (Pclass), цену билета (Fare), возраст пассажира (Age) и его пол (Sex).
3. Обратите внимание, что признак Sex имеет строковые значения.
4. Выделите целевую переменную — она записана в столбце Survived.
5. В данных есть пропущенные значения — например, для некоторых пассажиров неизвестен их возраст. Такие записи при чтении их в pandas принимают значение nan. Найдите все объекты, у которых есть пропущенные признаки, и удалите их из выборки.
6. Обучите решающее дерево с параметром random_state=241 и остальными параметрами по умолчанию (речь идет о параметрах конструктора DecisionTreeСlassifier).
7. Вычислите важности признаков и найдите два признака с наибольшей важностью. Их названия будут ответами для данной задачи (в качестве ответа укажите названия признаков через запятую или пробел, порядок не важен).

In [102]:
df3 = df[['Pclass', 'Sex', 'Age', 'Fare', 'Survived']].dropna()

In [105]:
y = df3.Survived

In [108]:
from sklearn.preprocessing import OrdinalEncoder
from sklearn.compose import ColumnTransformer

column_trans = ColumnTransformer(
    [('Sex', OrdinalEncoder(), ['Sex']),
     ('passthrough', 'passthrough', ['Pclass', 'Age', 'Fare'])],
    remainder='drop')

df3_transformed = column_trans.fit_transform(df3)

In [114]:
from sklearn.tree import DecisionTreeClassifier

clf = DecisionTreeClassifier(random_state=241)
clf.fit(df3_transformed, y.array)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=241, splitter='best')

In [115]:
clf.feature_importances_

array([0.30051221, 0.14000522, 0.2560461 , 0.30343647])

Т.е. наиболее важны Sex и Fare (колонки идут в порядке, в котором они перечислены в ColumnTransformer)

In [119]:
to_file('tree.txt', '{} {}'.format('Sex', 'Fare'))

Sex Fare